app/controllers/school_classes_controller.rb

  def index
    @school_classes = SchoolClass.all
---
SELECT "school_classes".* FROM "school_classes"

  def show
    @school_class = SchoolClass.find_by_id(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @school_class = SchoolClass.new(params.require(:school_class))
    @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Divination"], ["room_number", 100], ["created_at", "2018-08-12 04:10:24.582308"], ["updated_at", "2018-08-12 04:10:24.582308"]]

  def edit
    @school_class = SchoolClass.find_by_id(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 2]]

  def update
    @school_class = SchoolClass.find_by_id(params[:id])
    @school_class.update(params.require(:school_class))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2018-08-12 04:24:15.791895"], ["id", 1]]