app/controllers/students_controller.rb

  def show
    @student = Student.find_by_id(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 0]]

  def create
    @student = Student.new(params.require(:student))
    @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Hermione"], ["last_name", "Granger"], ["created_at", "2018-08-12 03:58:49.785594"], ["updated_at", "2018-08-12 03:58:49.785594"]]

  def edit
    @student = Student.find_by_id(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 2]]

  def update
    @student = Student.find_by_id(params[:id])
    @student.update(params.require(:student))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Ronald"], ["last_name", "Weasley"], ["updated_at", "2018-08-12 04:32:46.101419"], ["id", 1]]